Tekla.Structures.Dialog.UIControls.EnvironmentFiles
The EnvironmentFiles class is for the paths where the attributes file will be searched for.

Tekla.Structures.Dialog.UIControls.EnvironmentFiles.files
The directories where to look for property files.

Tekla.Structures.Dialog.UIControls.EnvironmentFiles.PropertyFileDirectories
The directories where to look for property files.

Tekla.Structures.Dialog.UIControls.EnvironmentFiles.GetStandardPropertyFileDirectories
Gets the paths where to look for the property files.
Returns: The paths where to look for the property files.

Tekla.Structures.Dialog.UIControls.EnvironmentFiles.IsValidDirectory(System.String)
Checks if a directory is valid.
directory: The directory to be checked.
Returns: True if the directory is valid.

Tekla.Structures.Dialog.UIControls.EnvironmentFiles.GetMultiDirectoryFileList(System.String)
Gets a list of files with the given extension from the default search directories.
fileExtension: The file extension to be used.
Returns: A list of files with the given extension.

Tekla.Structures.Dialog.UIControls.EnvironmentFiles.GetAttributeFiles(System.String)
Gets attribute files with specified suffix from model, XS_FIRM and XS_PROJECT directories and subdirectories.
suffix: The filename suffix.
Returns: A list of found file names

Tekla.Structures.Dialog.UIControls.EnvironmentFiles.GetMultiDirectoryFileList(System.Collections.Generic.List{System.String},System.String)
Gets a list of files with the given extension from the given search directories and from XS_FIRM, XS_PROJECT subdirectories.
searchDirectories: The search directories to be used.
fileExtension: The file extension to be used.
Returns: A list of found file names without the file extension.

Tekla.Structures.Dialog.UIControls.EnvironmentFiles.GetAttributeFile(System.String)
Gets a file info representing the first match in the standard property file directories.
fileName: The name of the file including the file extension.
Returns: A file info for the first match in the directory list. Null if no match was found.

Tekla.Structures.Dialog.UIControls.EnvironmentFiles.GetAttributeFile(System.Collections.Generic.List{System.String},System.String)
Gets a file info representing the first match in the search directories.
searchDirectories: The list of directories to be used for searching for the file.
fileName: The name of the file including the file extension.
Returns: A file info for the first match in the directory list. Null if no match was found.